{"config": [{"config": {"use_bias": true, "trainable": true, "filters": 32, "data_format": "channels_last", "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "batch_input_shape": [null, 96, 96, 1], "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"use_bias": true, "trainable": true, "filters": 32, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_regularizer": {"config": {"l1": 0.0, "l2": NaN}, "class_name": "L1L2"}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": {"config": {"l1": NaN, "l2": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "trainable": true, "filters": 64, "data_format": "channels_last", "kernel_size": [2, 2], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_regularizer": {"config": {"l1": 0.0, "l2": NaN}, "class_name": "L1L2"}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": {"config": {"l1": NaN, "l2": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "trainable": true, "filters": 128, "data_format": "channels_last", "kernel_size": [2, 2], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_4", "kernel_regularizer": {"config": {"l1": 0.0, "l2": NaN}, "class_name": "L1L2"}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": {"config": {"l1": NaN, "l2": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "trainable": true, "bias_regularizer": null, "units": 500, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": NaN}, "class_name": "L1L2"}, "name": "dense_1", "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": {"config": {"l1": NaN, "l2": 0.0}, "class_name": "L1L2"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "trainable": true, "bias_regularizer": null, "units": 500, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": NaN}, "class_name": "L1L2"}, "name": "dense_2", "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": {"config": {"l1": NaN, "l2": 0.0}, "class_name": "L1L2"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "trainable": true, "bias_regularizer": null, "units": 30, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_3", "kernel_constraint": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow"}