{"config": [{"config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "batch_input_shape": [null, 96, 96, 1], "filters": 32, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_1", "dtype": "float32", "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "filters": 32, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_2", "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null, "kernel_size": [2, 2], "use_bias": true, "name": "conv2d_3", "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "kernel_size": [2, 2], "use_bias": true, "name": "conv2d_4", "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 500, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 500, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "name": "dense_3", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 30, "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Sequential"}